12/data/attachments/aca1bf43319d5641.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cade49a0-d31e-482a-b58c-40693a53e945</nif:username>
            <nif:friendToBeAdded>Cynthia_should_Friend_94822_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>